app/Controllers/AppointmentController.php

SELECT *
FROM `appointment`
---
    public function index()
    {
        $data['items']=$this->appointment->findAll();