app/Controllers/Home.php

SELECT COUNT(*) AS `numrows`
FROM `appointment`
---
    public function index(): string
    {
        $data['totalappointment']=$this->appointment->countAllResults();