app/Controllers/LoginController.php

SELECT *
FROM `users`
WHERE `email` = 'sakib@gmail.com'
 LIMIT 1
---
    public function login(){
        $userModel = new UserModel();
        $session = session();
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        $data = $userModel->where('email', $email)->first();