app/Controllers/ServiceController.php

SELECT *
FROM `service`
---
    public function index()
    {
        $data['items']=$this->service->findAll();

INSERT INTO `service` (`name`, `price`, `doctor`, `mobile`) VALUES ('Orthopedics', '5484', 'dr.', '0158748547')
---
    public function store(){
        $data = [
            'name' => $this->request->getVar('name'),
            'price' => $this->request->getVar('price'),
            'doctor' => $this->request->getVar('dr'),
            'mobile' => $this->request->getVar('phn'),
        ];
        $rules = [
            'name' => 'required|max_length[30]|min_length[3]',
            'price' => 'required|numeric',
            'dr'    => 'required|max_length[30]|min_length[3]',
            // 'phn' => 'required|numeric',
                ];
        if(! $this->validate($rules)){
            return view("services/create");
        } else {
            $this->service->insert($data);